; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v3 - type_2 ?v4 - type_3)
 	      (pred_3 ?v2 - object ?v4 - type_3)
	      (pred_1 ?v3 - type_2 ?v7 - type_1)
	      (pred_2 ?v3 - type_2 ?v2 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v3 - type_2 ?v1 ?v5 - type_3)
       :precondition (and  (pred_4 ?v3 ?v1))
       :effect (and  (pred_4 ?v3 ?v5)
		     (not (pred_4 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_2 ?v6 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v8) (pred_4 ?v3 ?v8) (pred_1 ?v3 ?v7))
       :effect (and (pred_2 ?v3 ?v6 ?v7)
		    (not (pred_3 ?v6 ?v8)) 
		    (not (pred_1 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_2 ?v6 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v6 ?v7) (pred_4 ?v3 ?v8))
       :effect (and (pred_3 ?v6 ?v8)
		    (pred_1 ?v3 ?v7)
		    (not (pred_2 ?v3 ?v6 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_07 obj_04 - type_1
obj_08 obj_03 obj_01 - type_3
obj_06 obj_02 obj_05 - object)
(:init
(pred_4 obj_09 obj_01)
(pred_1 obj_09 obj_07)
(pred_1 obj_09 obj_04)
(pred_3 obj_06 obj_03)
(pred_3 obj_02 obj_01)
(pred_3 obj_05 obj_03)
)
(:goal
(and
(pred_3 obj_06 obj_03)
(pred_3 obj_02 obj_01)
(pred_3 obj_05 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_04))))
)
)

; plan
1. (op_2 obj_09 obj_01 obj_03)
   deleted: (pred_4 obj_09 obj_01)
   added: (pred_4 obj_09 obj_03)
   goals met: 2 of 3
2. (op_1 obj_09 obj_05 obj_03 obj_07)
   deleted: (pred_3 obj_05 obj_03) (pred_1 obj_09 obj_07)
   added: (pred_2 obj_09 obj_05 obj_07)
   goals met: 2 of 3
3. (op_2 obj_09 obj_03 obj_08)
   deleted: (pred_4 obj_09 obj_03)
   added: (pred_4 obj_09 obj_08)
   goals met: 2 of 3
4. (op_3 obj_09 obj_05 obj_08 obj_07)
   deleted: (pred_2 obj_09 obj_05 obj_07)
   added: (pred_3 obj_05 obj_08) (pred_1 obj_09 obj_07)
   goals met: 3 of 3
